"use client";

import React from "react";
import Image from "next/image";
import { useParams } from "next/navigation";
import { Title } from "@/components/Title/Title";
import style from "./message-from-minister.module.scss";

const MessagesFromMinisterScreen = () => {
  const params = useParams<{ lang: string }>();
  const currentLang = params?.lang;

  return (
    <div>
      <div className={`${style.main_minister_info}`}>
        <Title
          title={
            currentLang === "kh"
              ? "រដ្ឋមន្រ្តីក្រសួងពាណិជ្ជកម្ម"
              : "Minister of Commerce"
          }
        />
        <div className="container mx-auto px-4">
          <div className="flex flex-wrap">
            <div className="w-full lg:w-1/2 mb-4 lg:mb-0">
              <Image
                width={1000}
                height={1000}
                src="/minister.jpg"
                alt="Minister"
                className="w-full h-full rounded-lg"
              />
            </div>
            <div className="w-full lg:w-1/2 pl-0 lg:pl-5">
              <div style={{ marginLeft: "20px" }}>
                <div className="d-flex align-items-start">
                  {currentLang === "kh" ? (
                    <>
                      <div className={` ${style.font_fam}`}>
                        សារលោកជំទាវរដ្ឋមន្រ្តី
                      </div>
                    </>
                  ) : (
                    <>
                      <div className={` ${style.font_fam_en}`}>
                        MESSAGE FROM MINISTER
                      </div>
                    </>
                  )}
                </div>
                <div className={` ${style.minister_info}`}>
                  <div className={` ${style.minister_tilte}`}>
                    {currentLang === "kh" ? "លោកជំទាវ" : "Her Excellency"} ចម
                    និម្មល{" "}
                  </div>
                  <div className={` ${style.minister_des}`}>
                    {currentLang === "kh"
                      ? "រដ្ឋមន្រ្តីក្រសួងពាណិជ្ជកម្ម"
                      : "Minister of Commerce"}
                  </div>
                </div>
              </div>
            </div>
          </div>
        </div>
      </div>
      <div className="container mx-auto px-4 mt-8">
        <div className={`${style.messages_tilte}`}>
          {currentLang === "kh"
            ? "សារ​ស្វាគមន៍​របស់រដ្ឋមន្ត្រី"
            : "Minister's Welcome Notice"}
        </div>
        <div className={`${style.messages_paragraph1}`}>
          វិស័យពាណិជ្ជកម្ម ជាវិស័យដ៏សំខាន់មួយ
          ក្នុងការធ្វើឱ្យ​ប្រសើរឡើង​នូវ​ផលិតកម្ម កម្រិត​ចំណូល កំណើនសេដ្ឋកិច្ច
          និងការអភិវឌ្ឍរបស់កម្ពុជា។ ក្រោមការដឹកនាំរបស់រាជរដ្ឋាភិបាល
          ជាមួយនឹងការដាក់ចេញនូវ​យុទ្ធសាស្រ្តចតុកោណ​ដំណាក់កាលទី៤ ដើម្បីកំណើន
          ការងារ សមធម៌ និងប្រសិទ្ធភាព កសាងមូលដ្ឋានឆ្ពោះទៅសម្រេច​
          ចក្ខុវិស័យកម្ពុជា ឆ្នាំ២០៥០ ដែលកម្ពុជានឹងក្លាយជាប្រទេស​មាន​ចំណូលខ្ពស់
          ឬជាប្រទេសអភិវឌ្ឍន៍
          ក្រសួងពាណិជ្ជកម្មបាន​ដាក់ចេញនូវយុទ្ធសាស្ត្រពាណិជ្ជកម្ម​ជា​បន្តបន្ទាប់
          ប្រកបដោយសង្គតភាពជាមួយយុទ្ធសាស្រ្តចតុកោណ
          ផែនការយុទ្ធសាស្រ្តអភិវឌ្ឍន៍ជាតិ គោលដៅអភិវឌ្ឍប្រកបដោយចីរភាព
          និងនយោបាយអភិវឌ្ឍន៍​វិស័យ​ឧស្សាហកម្ម​របស់រាជរដ្ឋាភិបាល
          ដើម្បីរួមចំណែកថែរក្សា និង​ជំរុញ
          អត្រាកំណើនសេដ្ឋកិច្ចកម្ពុជាឱ្យបានខ្លាំងក្លាជា​បន្ត​បន្ទាប់។
        </div>
        <div className={`${style.messages_paragraph2}`}>
          ក្រសួងពាណិជ្ជកម្មបានខិតខំធ្វើការកែទម្រង់
          និងបានអនុវត្តយ៉ាងខ្ជាប់ខ្ជួននូវកម្មវិធីគោលនយោបាយ
          និងយុទ្ធសាស្រ្តរបស់រាជរដ្ឋាភិបាលក្នុងការអភិវឌ្ឍវិស័យពាណិជ្ជកម្ម
          ជាអាទិ៍ការពង្រឹងលើក​ស្ទួយផលិតកម្ម ដើម្បីផ្គត់ផ្គង់តម្រូវការក្នុងស្រុក
          និងការនាំចេញតាមរយៈការធ្វើពិពិធកម្មទីផ្សារ សំដៅជំរុញ​កំណើន
          និងបង្កើនល្បឿនសមាហរណកម្មសេដ្ឋកិច្ច ពាណិជ្ជកម្មតំបន់ និងពិភពលោក។
        </div>
        <div className={`${style.messages_paragraph3}`}>
          ក្រសួងពាណិជ្ជកម្ម ជំរុញវិស័យពាណិជ្ជកម្មឱ្យកាន់តែរីកចម្រើន
          តាមរយៈការធ្វើកំណែទម្រង់ស៊ី​ជម្រៅ ការកាត់បន្ថយចំណាយ
          និងការពង្រឹងភាពប្រកួតប្រជែងនៃទំនិញនាំចេញរបស់កម្ពុជាទៅកាន់ទីផ្សារ​អន្តរជាតិ
          ដោយបង្កលក្ខណៈងាយស្រួល និងបង្កើតបរិយាកាសអំណោយផលដល់ការធ្វើធុរកិច្ច
          និងការ វិនិយោគនៅក្នុងប្រទេសកម្ពុជា។
          ទន្ទឹមនឹងការរក្សាបាននូវកំណើននៃការនាំចេញ
          តាមរយៈការប្រើប្រាស់ទីផ្សារអនុគ្រោះដែលមានស្រាប់
          ក្រសួងពាណិជ្ជកម្មបានធ្វើពិពិធកម្មទីផ្សារបន្ថែមដូចជា
          ការចរចាបង្កើតតំបន់ពាណិជ្ជកម្មសេរីទ្វេភាគីនិងពហុភាគី
          ដើម្បីឱ្យទីផ្សារទំនិញ សេវាកម្ម
          និងវិនិយោគកម្ពុជាកាន់តែមាន​ភាពទូលំទូលាយ។
          លើសពីនេះការការពារកម្មសិទ្ធិបញ្ញា កិច្ចការពារអ្នកប្រើប្រាស់
          ការត្រួតពិនិត្យ និងបង្រ្កាបការក្លែងបន្លំនូវផលិតផលទំនិញ
          និងសេវាកម្មគ្រប់ប្រភេទ ក៏ត្រូវបានអនុវត្តដោយយកចិត្តទុកដាក់
          និងប្រកប​ដោយស្មារតីទទួលខុសត្រូវខ្ពស់បំផុត។ ម្យ៉ាងទៀត
          ការផ្តល់សេវាសាធារណៈជូនដល់វិស័យឯកជន
          ក៏ត្រូវបានកែលម្អជាបន្តបន្ទាប់ឱ្យកាន់តែប្រសើរជាងមុន
          តាមរយៈការដាក់ឱ្យប្រើប្រាស់ទាំងស្រុងនូវ​ប្រព័ន្ធបច្ចេកវិទ្យាព័ត៌មានវិទ្យាទំនើប
          ដែលក្នុងនោះ ថ្លៃសេវា ពេលវេលា និងបែបបទដែលបង្កការលំបាក ស្មុគ្រស្មាញ
          ក៏ត្រូវបានកាត់បន្ថយផងដែរ។
        </div>
        <div className={`${style.messages_paragraph4}`}>
          ក្នុងគោលដៅដើម្បីចូលរួមប្រកួតប្រជែងក្នុងក្របខ័ណ្ឌតំបន់ និងពិភពលោក
          ក្រសួងពាណិជ្ជកម្ម បាននិងកំពុងខិតខំពង្រឹងសមត្ថភាព
          និងប្រសិទ្ធភាពការងាររបស់មន្រ្តីរាជការបន្ថែមទៀត
          តាមរយៈការបន្ត​កសាងធនធានមនុស្ស
          ការធ្វើកំណែទម្រង់រចនាសម្ព័ន្ធរដ្ឋបាលនិងគ្រប់គ្រង ការអភិវឌ្ឍស្ថាប័ន
          រួមទាំងការ​កសាងច្បាប់
          និងលិខិតបទដ្ឋានគតិយុត្តពាក់ព័ន្ធនឹងវិស័យពាណិជ្ជកម្មមួយចំនួនផងដែរ។{" "}
        </div>
      </div>
    </div>
  );
};

export default MessagesFromMinisterScreen;
