// CustomsTrariffRate.jsx
import CustomsTariffRateTable from "./components/CustomsTariffRateTable";
import style from "./customs-tariff-rate.module.scss";

export const CustomsTariffRate = () => {
  const tableData = [
    {
      title: "១. ប្រទេសចិន៖",
      headers: ["ទីផ្សារ", "MFN", "ACFTA", "RCEP", "CCFTA", "LDCs"],
      data: [
        ["គ្រាប់ស្វាយចន្ទីមានសំបក", "20%", "0%", "0%", "0%", "0%"],
        ["គ្រាប់ស្វាយចន្ទីបកសំបក", "10%", "0%", "0%", "0%", "0%"],
      ],
    },
    {
      title: "២. សាធារណរដ្ឋកូរ៉េ៖",
      headers: ["ទីផ្សារ", "MFN", "AKFTA", "RCEP", "CKFTA", "LDCs"],
      data: [
        ["គ្រាប់ស្វាយចន្ទីមានសំបក", "8%", "5%", "6.4%", "8%", "0%"],
        ["គ្រាប់ស្វាយចន្ទីបកសំបក", "8%", "5%", "6.4%", "8%", "0%"],
      ],
    },
    {
      title: "៣. សហរដ្ឋអាមេរិក៖",
      headers: ["ទីផ្សារ", "MFN", "LDCs"],
      data: [
        ["គ្រាប់ស្វាយចន្ទីមានសំបក", "0%", "0%"],
        ["គ្រាប់ស្វាយចន្ទីបកសំបក", "0%", "0%"],
      ],
    },
    {
      title: "៤. ប្រទេសឥណ្ឌា៖",
      headers: ["ទីផ្សារ", "MFN", "AIFTA", "LDCs"],
      data: [
        ["គ្រាប់ស្វាយចន្ទីមានសំបក", "2.5%", "0%", "0%"],
        ["គ្រាប់ស្វាយចន្ទីបកសំបក", "30%", "30%", "30%"],
      ],
    },
    {
      title: "៥. ប្រទេសអេមីរ៉ាតអារ៉ាប់រួម៖",
      headers: ["ទីផ្សារ", "MFN", "CAM-UAE"],
      data: [
        ["គ្រាប់ស្វាយចន្ទីមានសំបក", "5%", "0%"],
        ["គ្រាប់ស្វាយចន្ទីបកសំបក", "5%", "0%"],
      ],
    },
    {
      title: "៦. ប្រទេសបារាំង៖",
      headers: ["ទីផ្សារ", "MFN", "LDC"],
      data: [
        ["គ្រាប់ស្វាយចន្ទីមានសំបក", "0%", "0%"],
        ["គ្រាប់ស្វាយចន្ទីបកសំបក", "0%", "0%"],
      ],
    },
    {
      title: "៧. ប្រទេសអាល្លឺម៉ង់៖",
      headers: ["ទីផ្សារ", "MFN", "LDC"],
      data: [
        ["គ្រាប់ស្វាយចន្ទីមានសំបក", "0%", "0%"],
        ["គ្រាប់ស្វាយចន្ទីបកសំបក", "0%", "0%"],
      ],
    },
    {
      title: "៨. ប្រទេសហូឡង់៖",
      headers: ["ទីផ្សារ", "MFN", "LDC"],
      data: [
        ["គ្រាប់ស្វាយចន្ទីមានសំបក", "0%", "0%"],
        ["គ្រាប់ស្វាយចន្ទីបកសំបក", "0%", "0%"],
      ],
    },
    {
      title: "៩. ចក្រភពអង់គ្លេស៖",
      headers: ["ទីផ្សារ", "MFN", "LDC"],
      data: [
        ["គ្រាប់ស្វាយចន្ទីមានសំបក", "0%", "0%"],
        ["គ្រាប់ស្វាយចន្ទីបកសំបក", "0%", "0%"],
      ],
    },
    {
      title: "១០. ប្រទេសសិង្ហបុរី៖",
      headers: ["ទីផ្សារ", "MFN", "AANZFTA", "RCEP", "ASEAN"],
      data: [
        ["គ្រាប់ស្វាយចន្ទីមានសំបក", "0%", "0%", "0%", "0%"],
        ["គ្រាប់ស្វាយចន្ទីបកសំបក", "0%", "0%", "0%", "0%"],
      ],
    },
    {
      title: "១១. ប្រទេសថៃ៖",
      headers: ["ទីផ្សារ", "MFN", "AANZFTA", "RCEP", "ASEAN", "LDC"],
      data: [
        ["គ្រាប់ស្វាយចន្ទីមានសំបក", "62.23%", "0%", "62.23%", "0%", "0%"],
        ["គ្រាប់ស្វាយចន្ទីបកសំបក", "62.23%", "0%", "62.23%", "0%", "0%"],
      ],
    },
    {
      title: "១២. ប្រទេសវៀតណាម៖",
      headers: ["ទីផ្សារ", "MFN", "AANZFTA", "RCEP", "ASEAN"],
      data: [
        ["គ្រាប់ស្វាយចន្ទីមានសំបក", "5%", "0%", "0%", "0%"],
        ["គ្រាប់ស្វាយចន្ទីបកសំបក", "5%", "0%", "0%", "0%"],
      ],
    },
  ];

  return (
    <div className={`${style.paragraph}`}>
      <h2 className={` ${style.bold_text}`}>គ. អត្រាពន្ធគយ</h2>

      <p className={`pt-2`} style={{ textIndent: "50px" }}>
        តារាងពន្ធគយក្រោមកិច្ចព្រមព្រៀងតំបន់ និងទ្វេភាគី<sup>៣</sup>៖
      </p>

      {tableData.map((table, index) => (
        <div key={index}>
          <h3 className={`${style.bold_smaller_text}`}>{table.title}</h3>
          <CustomsTariffRateTable columns={table.headers} data={table.data} />
        </div>
      ))}

      {/* <hr /> */}
      <div className="">
        <p>
          <strong>ប្រភព៖</strong>
        </p>
        <sup>៣</sup>ITC Trade Map, Asean, https://findrulesoforigin.org/
        <br />
      </div>
    </div>
  );
};
